[
    {
        "title": "The AI trade is back, as confidence in Big Tech surges",
        "date": "2024-04-28T16:00:13Z",
        "description": "Standout earnings results from Microsoft and Alphabet are drawing investors' attention back to AI.",
        "content": "The AI craze has returned to Wall Street and investors are buying in.\r\nStandout quarterly results from Microsoft (MSFT) and Alphabet (GOOG, GOOGL) put the AI narrative back on track, sparking renewed… [+2337 chars]"
    },
    {
        "title": "New iOS 18 AI Security Move Changes The Game For All iPhone Users - Forbes",
        "date": "2024-04-28T15:13:54Z",
        "description": "New iOS 18 AI Security Move Changes The Game For All iPhone UsersForbes Apple’s (AAPL) OpenAI Talks Intensify as It Seeks to Add AI FeaturesBloomberg Apple negotiating with OpenAI and Google to bring AI to next iPhone: reportBusiness Insider Apple is forging …",
        "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
    },
    {
        "title": "3 Reasons to Buy Apple Stock Like There's No Tomorrow",
        "date": "2024-04-28T15:08:04Z",
        "description": "The past few weeks have been tough for Apple (NASDAQ: AAPL) shareholders. The stock's now sitting 15% below its December high, sliding all the way back to where it was trading in late 2021. This is weakness that most investors just aren't accustomed to seeing…",
        "content": "The past few weeks have been tough for Apple (NASDAQ: AAPL) shareholders. The stock's now sitting 15% below its December high, sliding all the way back to where it was trading in late 2021. This is w… [+291 chars]"
    },
    {
        "title": "2 Beaten-Down Dividend Stocks to Buy and Hold Forever",
        "date": "2024-04-28T14:40:04Z",
        "description": "Finding \"forever\" stocks isn't easy. Corporations that can thrive and pay dividends for long periods are rare, but they do exist. Such companies tend to have several qualities, including competitive advantages and leadership in industries that are likely to c…",
        "content": "Finding \"forever\" stocks isn't easy. Corporations that can thrive and pay dividends for long periods are rare, but they do exist. Such companies tend to have several qualities, including competitive … [+303 chars]"
    },
    {
        "title": "Clean Yield Group Lowers Position in Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-28T12:14:41Z",
        "description": "Clean Yield Group trimmed its stake in Apple Inc. (NASDAQ:AAPL – Free Report) by 0.3% during the fourth quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The firm owned 86,760 shares of the iPhone maker’s stoc…",
        "content": "Clean Yield Group trimmed its stake in Apple Inc. (NASDAQ:AAPL – Free Report) by 0.3% during the fourth quarter, according to its most recent disclosure with the Securities and Exchange Commission (S… [+6931 chars]"
    },
    {
        "title": "What To Expect in the Markets This Week",
        "date": "2024-04-28T12:00:00Z",
        "description": "Coming up: Fed rate decision, jobs report, and earnings from Apple, Amazon, AMD",
        "content": "<ul><li>The Federal Reserve is expected to leave interest rates unchanged when it meets this week, and most attention will turn to Chair Jerome Powell's press conference after the Wednesday decision.… [+4957 chars]"
    },
    {
        "title": "A Fed meeting, jobs report, and more Big Tech earnings: What to know this week",
        "date": "2024-04-28T11:36:43Z",
        "description": "After a bounceback week for stocks, a Fed meeting, jobs report, and a busy week of corporate earnings are set to greet investors.",
        "content": "Stocks rebounded as tech earnings spawned a rally in markets despite growing concerns that the Fed will hold interest rates higher for longer.\r\nThe Nasdaq Composite (^IXIC) rose more than 4% last wee… [+8447 chars]"
    },
    {
        "title": "Almost Half of Warren Buffett's $374 Billion Portfolio Is Invested in Only 1 Stock",
        "date": "2024-04-28T11:24:04Z",
        "description": "Besides having wholly owned operating businesses, Berkshire Hathaway holds a massive $374 billion public-equities portfolio. In total, there are nearly four dozen stocks in which the conglomerate has a stake. You'll quickly realize, however, that Apple (NASDA…",
        "content": "Besides having wholly owned operating businesses, Berkshire Hathaway holds a massive $374 billion public-equities portfolio. In total, there are nearly four dozen stocks in which the conglomerate has… [+296 chars]"
    },
    {
        "title": "Earnings And Artificial Intelligence Save Stocks Despite Inflation",
        "date": "2024-04-28T11:00:00Z",
        "description": "Despite hot inflation data, earnings reinforced the promise of artificial intelligence. This week is packed with earnings, the Fed, a jobs report, and the Berkshire Hathaway meeting.",
        "content": "The promise of artificial intelligence (AI) was bolstered by Microsoft (MSFT) and Alphabet (GOOGL) ... [+] earnings.\r\ngetty\r\nThe pace of earnings picked up steam last week, with 159 S&amp;P 500 compa… [+5733 chars]"
    },
    {
        "title": "If You Invested $10,000 in Warren Buffett's Top 3 Stocks 10 Years Ago, This Is How Much You'd Have Today",
        "date": "2024-04-28T10:56:04Z",
        "description": "Billionaire investor Warren Buffett has a massive following in the investing world. Many investors often mimic his picks, knowing that investments Buffett chooses for his portfolio have solid fundamentals and can make for good long-term investments. The three…",
        "content": "Billionaire investor Warren Buffett has a massive following in the investing world. Many investors often mimic his picks, knowing that investments Buffett chooses for his portfolio have solid fundame… [+298 chars]"
    },
    {
        "title": "Do Apple’s Big Events Matter Anymore?",
        "date": "2024-04-28T10:44:07Z",
        "description": "Steve Jobs used to plan and announce Apple’s (NASDAQ: AAPL) big events for developers, customers, and the press months in advance. He would wear his trademark black turtleneck, basic Levi’s jeans, and New Balance shoes. He would talk for several minutes to ha…",
        "content": "Steve Jobs used to plan and announce Apples (NASDAQ: AAPL) big events for developers, customers, and the press months in advance. He would wear his trademark black turtleneck, basic Levis jeans, and … [+280 chars]"
    },
    {
        "title": "Augustine Asset Management Inc. Has $26.44 Million Position in Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-28T10:12:41Z",
        "description": "Augustine Asset Management Inc. increased its holdings in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 3.0% in the fourth quarter, according to its most recent filing with the SEC. The fund owned 137,306 shares of the iPhone maker’s stock after acquiri…",
        "content": "Augustine Asset Management Inc. increased its holdings in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 3.0% in the fourth quarter, according to its most recent filing with the SEC. The fund ow… [+6329 chars]"
    },
    {
        "title": "Apple Inc. (NASDAQ:AAPL) Shares Sold by GFS Advisors LLC",
        "date": "2024-04-28T10:12:41Z",
        "description": "GFS Advisors LLC cut its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 4.9% during the 4th quarter, according to its most recent 13F filing with the Securities and Exchange Commission. The fund owned 212,214 shares of the iPhone maker’s stock a…",
        "content": "GFS Advisors LLC cut its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 4.9% during the 4th quarter, according to its most recent 13F filing with the Securities and Exchange Commission.… [+6912 chars]"
    },
    {
        "title": "Apple Inc. (NASDAQ:AAPL) Shares Bought by International Assets Investment Management LLC",
        "date": "2024-04-28T09:28:41Z",
        "description": "International Assets Investment Management LLC increased its position in Apple Inc. (NASDAQ:AAPL – Free Report) by 14,395.4% in the 4th quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission (SEC). The firm…",
        "content": "International Assets Investment Management LLC increased its position in Apple Inc. (NASDAQ:AAPL – Free Report) by 14,395.4% in the 4th quarter, according to the company in its most recent 13F filing… [+6740 chars]"
    },
    {
        "title": "17,540 Shares in Apple Inc. (NASDAQ:AAPL) Acquired by Arvest Investments Inc.",
        "date": "2024-04-28T09:28:41Z",
        "description": "Arvest Investments Inc. bought a new position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) during the fourth quarter, according to its most recent 13F filing with the Securities and Exchange Commission (SEC). The institutional investor bought 17,540 sh…",
        "content": "Arvest Investments Inc. bought a new position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) during the fourth quarter, according to its most recent 13F filing with the Securities and Exchange C… [+6675 chars]"
    },
    {
        "title": "KRS Capital Management LLC Sells 541 Shares of Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-28T08:56:41Z",
        "description": "KRS Capital Management LLC decreased its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.8% during the 4th quarter, according to the company in its most recent 13F filing with the Securities & Exchange Commission. The institutional investor …",
        "content": "KRS Capital Management LLC decreased its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.8% during the 4th quarter, according to the company in its most recent 13F filing with the S… [+6909 chars]"
    },
    {
        "title": "Apple Inc. (NASDAQ:AAPL) Shares Sold by Asset Management One Co. Ltd.",
        "date": "2024-04-28T08:22:42Z",
        "description": "Asset Management One Co. Ltd. reduced its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 3.8% in the 4th quarter, according to its most recent 13F filing with the Securities and Exchange Commission. The firm owned 6,608,818 shares of the iPhone …",
        "content": "Asset Management One Co. Ltd. reduced its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 3.8% in the 4th quarter, according to its most recent 13F filing with the Securities and Exchang… [+6592 chars]"
    },
    {
        "title": "米Anker、単ポート最大65W出力でMacBook Pro/Airの充電も可能な容量20,000mAhのUSB-Cケーブル一体型モバイルバッテリー「Anker Power Bank (20K, 87W, Built-In USB-C Cable)」を発売。",
        "date": "2024-04-28T01:22:50Z",
        "description": "米Ankerが単ポート最大65W出力でMacBook Pro/Airの充電も可能なバッテリー容量20,000mAhのUSB-Cケーブル一体型モバイルバッテリー「Anker Power Bank (20K, 87W, B […]\nThe post 米Anker、単ポート最大65W出力でMacBook Pro/Airの充電も可能な容量20,000mAhのUSB-Cケーブル一体型モバイルバッテリー「Anker Power Bank (20K, 87W, Built-In USB-C Cable)」を発売。 first …",
        "content": "Anker65WMacBook Pro/Air20,000mAhUSB-CAnker Power Bank (20K, 87W, Built-In USB-C Cable)\r\nAnker20240427iPhoneMacBook Air/Pro20,000mAhUSB-CAnker Power Bank (20K, 87W, Built-In USB-C Cable) (A1383)\r\nDist… [+824 chars]"
    },
    {
        "title": "Apple reportedly courting OpenAI to develop AI features for iPhone - Cointelegraph",
        "date": "2024-04-27T23:33:39Z",
        "description": "Apple reportedly courting OpenAI to develop AI features for iPhoneCointelegraph Apple’s (AAPL) OpenAI Talks Intensify as It Seeks to Add AI FeaturesBloomberg New iOS 18 AI Security Move Changes The Game For All iPhone UsersForbes Apple renews talks with OpenA…",
        "content": "Congratulations! You are the one-millionth user to log into our system.\r\nIf there's anything special we can do for you, anything at all, don't\r\nhesitate to ask!"
    },
    {
        "title": "Apple has reportedly resumed talks with OpenAI to build a chatbot for the iPhone - Engadget",
        "date": "2024-04-27T21:32:51Z",
        "description": "Apple has reportedly resumed talks with OpenAI to build a chatbot for the iPhoneEngadget Apple’s (AAPL) OpenAI Talks Intensify as It Seeks to Add AI FeaturesBloomberg New iOS 18 AI Security Move Changes The Game For All iPhone UsersForbes Apple renews talks w…",
        "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
    },
    {
        "title": "12 portfolio companies report earnings in the week ahead. What we want to hear from each",
        "date": "2024-04-27T14:00:01Z",
        "description": "All three major U.S. stock indexes rose this week. Earnings are once again poised drive the week ahead.",
        "content": "The major U.S. stock indexes closed higher for the week, with the S &amp; P 500 and Nasdaq Composite breaking multiweek losing streaks. Earnings drove the action, despite some less-than-ideal macroec… [+14347 chars]"
    },
    {
        "title": "It’s Time, Apple Has Rolled Over",
        "date": "2024-04-27T13:44:06Z",
        "description": "24/7 Wall St. analysts Doug McIntyre and Lee Jackson discuss Warren Buffett’s potential influence on Apple’s management, particularly in driving innovation beyond the current product line. Despite traditionally avoiding tech investments, Buffett’s engagement …",
        "content": "24/7 Wall St. analysts Doug McIntyre and Lee Jackson discuss Warren Buffetts potential influence on Apples management, particularly in driving innovation beyond the current product line. Despite trad… [+286 chars]"
    },
    {
        "title": "Buffett Is Trapped, Plain and Simple",
        "date": "2024-04-27T12:18:09Z",
        "description": "In this discussion, Doug McIntyre, editor-in-chief of 24-7 Wall Street, speaks with Lee Jackson about Warren Buffett’s large investment in Apple (Nasdaq: AAPL) and whether Buffett is now “trapped” by this investment. They explore the implications of Buffett’s…",
        "content": "In this discussion, Doug McIntyre, editor-in-chief of 24-7 Wall Street, speaks with Lee Jackson about Warren Buffetts large investment in Apple (Nasdaq: AAPL) and whether Buffett is now trapped by th… [+294 chars]"
    },
    {
        "title": "Apple Shares Reach Danger Zone",
        "date": "2024-04-27T12:18:08Z",
        "description": "Megatech companies Alphabet (NASDAQ: GOOG) and Microsoft (NASDAQ: MSFT) posted impressive earnings, which drove both stocks higher. So far this year, Alphabet shares have risen 24%, and Microsoft’s shares have risen 8%. Apple’s (NASDAQ: AAPL) shares have fall…",
        "content": "Megatech companies Alphabet (NASDAQ: GOOG) and Microsoft (NASDAQ: MSFT) posted impressive earnings, which drove both stocks higher. So far this year, Alphabet shares have risen 24%, and Microsofts sh… [+281 chars]"
    },
    {
        "title": "Apple, Amazon, Big Pharma And The Fed: Investing Action Plan",
        "date": "2024-04-27T12:04:05Z",
        "description": "As April heads for its last couple of trading days, and the first-quarter earnings season moves past its midpoint, the stock market is braced for a brisk week of news. Earnings from Apple ((AAPL)), Amazon.com (AMZN), big pharma and biotech names like Pfizer (…",
        "content": "As April heads for its last couple of trading days, and the first-quarter earnings season moves past its midpoint, the stock market is braced for a brisk week of news. Earnings from Apple ((AAPL)), A… [+268 chars]"
    },
    {
        "title": "These Are the 10 Priciest Stocks in Warren Buffett’s Portfolio",
        "date": "2024-04-27T11:01:08Z",
        "description": "Warren Buffet is a well-known investing guru, so it makes sense that investors want to know what he's currently investing in. The good news is that you can...",
        "content": "Molly Riley / UPI / Shutterstock.com\r\nWarren Buffet is a well-known investing guru, so it makes sense that investors want to know what hes currently investing in. The good news is that you can take a… [+2494 chars]"
    },
    {
        "title": "After Apple Stock Has Skyrocketed 527%, Why Does Warren Buffett Still Own It?",
        "date": "2024-04-27T09:58:05Z",
        "description": "It's not a surprise that most investors closely follow Warren Buffett. Based on his track record managing Berkshire Hathaway, he's arguably the greatest capital allocator ever. The Oracle of Omaha has owned many stocks over the years, but none has moved the n…",
        "content": "It's not a surprise that most investors closely follow Warren Buffett. Based on his track record managing Berkshire Hathaway, he's arguably the greatest capital allocator ever.The Oracle of Omaha has… [+300 chars]"
    },
    {
        "title": "Clear Creek Financial Management LLC Sells 738 Shares of Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-27T09:34:41Z",
        "description": "Clear Creek Financial Management LLC trimmed its position in Apple Inc. (NASDAQ:AAPL – Free Report) by 1.7% during the fourth quarter, according to its most recent 13F filing with the SEC. The fund owned 43,233 shares of the iPhone maker’s stock after selling…",
        "content": "Clear Creek Financial Management LLC trimmed its position in Apple Inc. (NASDAQ:AAPL – Free Report) by 1.7% during the fourth quarter, according to its most recent 13F filing with the SEC. The fund o… [+6878 chars]"
    },
    {
        "title": "Apple Inc. (NASDAQ:AAPL) Shares Sold by Breakwater Capital Group",
        "date": "2024-04-27T08:20:41Z",
        "description": "Breakwater Capital Group decreased its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 1.7% during the 4th quarter, according to the company in its most recent filing with the Securities and Exchange Commission (SEC). The firm owned 78,727 shares…",
        "content": "Breakwater Capital Group decreased its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 1.7% during the 4th quarter, according to the company in its most recent filing with the Securities… [+6582 chars]"
    },
    {
        "title": "Corundum Group Inc. Reduces Position in Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-27T08:20:41Z",
        "description": "Corundum Group Inc. trimmed its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 4.5% in the fourth quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission (SEC). The firm owned 34,685 shares of the iPh…",
        "content": "Corundum Group Inc. trimmed its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 4.5% in the fourth quarter, according to its most recent Form 13F filing with the Securities and Exchan… [+6328 chars]"
    },
    {
        "title": "Short Interest in GraniteShares 2x Long AAPL Daily ETF (NASDAQ:AAPB) Rises By 304.3%",
        "date": "2024-04-27T07:24:44Z",
        "description": "GraniteShares 2x Long AAPL Daily ETF (NASDAQ:AAPB – Get Free Report) was the recipient of a large increase in short interest during the month of April. As of April 15th, there was short interest totalling 19,000 shares, an increase of 304.3% from the March 31…",
        "content": "GraniteShares 2x Long AAPL Daily ETF (NASDAQ:AAPB – Get Free Report) was the recipient of a large increase in short interest during the month of April. As of April 15th, there was short interest tota… [+1220 chars]"
    },
    {
        "title": "Apple reportedly negotiating with OpenAI to power iOS 18 features - 9to5Mac",
        "date": "2024-04-27T05:13:30Z",
        "description": "Apple reportedly negotiating with OpenAI to power iOS 18 features9to5Mac Apple’s (AAPL) OpenAI Talks Intensify as It Seeks to Add AI FeaturesBloomberg Apple Negotiating With OpenAI and Google to Bring AI to Next iPhone: ReportBusiness Insider New iOS 18 AI Se…",
        "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
    },
    {
        "title": "Should You Buy Apple Stock Before Earnings?",
        "date": "2024-04-27T02:44:05Z",
        "description": "Fool.com contributor Parkev Tatevosian answers the question of whether investors should buy Apple (NASDAQ: AAPL) stock before its earnings announcement. *Stock prices used were the afternoon prices of April 24, 2024. The video was published on April 26, 2024.…",
        "content": "Fool.com contributor Parkev Tatevosian answers the question of whether investors should buy Apple (NASDAQ: AAPL) stock before its earnings announcement.*Stock prices used were the afternoon prices of… [+250 chars]"
    },
    {
        "title": "Goodbye Google Gemini? Apple In Talks With Microsoft-Backed OpenAI For iPhone AI Features: Report",
        "date": "2024-04-27T02:22:04Z",
        "description": "Apple Inc. AAPL has reportedly resumed discussions with Microsoft Corp.-backed MSFT OpenAI about incorporating the startup’s AI technology into the upcoming iPhone features. What Happened: Apple is in talks with OpenAI to potentially integrate its technology …",
        "content": "Apple Inc. AAPL has reportedly resumed discussions with Microsoft Corp.-backed MSFT OpenAI about incorporating the startups AI technology into the upcoming iPhone features.What Happened: Apple is in … [+281 chars]"
    },
    {
        "title": "Dow Jones Futures: Nvidia Leads 7 New Buys As Market Roars; Fed, Apple, Super Micro Loom",
        "date": "2024-04-27T01:06:08Z",
        "description": "Dow Jones futures will open Sunday evening, along with S&P 500 futures and Nasdaq futures, after a big week for the Nasdaq and leading stocks. Apple (AAPL), Amazon.com (AMZN), Novo Nordisk (NVO), Eli Lilly (LLY), Super Micro Computer (SMCI) and Advanced Micro…",
        "content": "Dow Jones futures will open Sunday evening, along with S&amp;P 500 futures and Nasdaq futures, after a big week for the Nasdaq and leading stocks.Apple (AAPL), Amazon.com (AMZN), Novo Nordisk (NVO), … [+292 chars]"
    },
    {
        "title": "Meta Platforms Bought Some Time With Long-Term AI Potential",
        "date": "2024-04-27T00:38:06Z",
        "description": "On Wednesday, Meta Platforms Inc (NASDAQ: META) topped Wall Street estimates with its first quarter results. But, stock plunged 16% due to a light revenue guidance that overshadowed the fact its revenue grew at a fastest quarterly rate since 2021 and net inco…",
        "content": "On Wednesday, Meta Platforms Inc (NASDAQ: META) topped Wall Street estimates with its first quarter results. But, stock plunged 16% due to a light revenue guidance that overshadowed the fact its reve… [+297 chars]"
    },
    {
        "title": "Apple’s (AAPL) OpenAI Talks Intensify as It Seeks to Add AI Features - Bloomberg",
        "date": "2024-04-27T00:14:25Z",
        "description": "Apple’s (AAPL) OpenAI Talks Intensify as It Seeks to Add AI FeaturesBloomberg Apple renews talks with OpenAI for iPhone generative AI features, Bloomberg News reportsYahoo! Voices New iOS 18 AI Security Move Changes The Game For All iPhone UsersForbes Apple i…",
        "content": "New York... when civilization falls apart, remember, we were way ahead of you.\r\n- David Letterman"
    },
    {
        "title": "Nvidia Leads 7 Stocks Flashing Buy Signals; As Market Roars Back",
        "date": "2024-04-26T22:18:04Z",
        "description": "Dow Jones futures will open Sunday evening, along with S&P 500 futures and Nasdaq futures, after a big week for the Nasdaq and leading stocks. Apple (AAPL), Amazon.com (AMZN), Novo Nordisk (NVO), Eli Lilly (LLY), Super Micro Computer (SMCI) and Advanced Micro…",
        "content": "Dow Jones futures will open Sunday evening, along with S&amp;P 500 futures and Nasdaq futures, after a big week for the Nasdaq and leading stocks.Apple (AAPL), Amazon.com (AMZN), Novo Nordisk (NVO), … [+292 chars]"
    },
    {
        "title": "A Big Week For The Stock Market: Apple, Amazon, Big Pharma And The Fed",
        "date": "2024-04-26T22:17:17Z",
        "description": "Investors brace for a big week of earnings and econ as Apple, Amazon, Big Pharma and The Fed all line up to deliver news.",
        "content": "As April heads for its last couple of trading days, and the first-quarter earnings season moves past its midpoint, the stock market is braced for a brisk week of news. Earnings from Apple ((AAPL)), A… [+6814 chars]"
    },
    {
        "title": "Dow Jones Futures: Nvidia Leads 7 New Buys As Market Roars; Fed, Apple, Super Micro Loom",
        "date": "2024-04-26T21:35:46Z",
        "description": "Investors can make new buys but Fed, key earnings loom.",
        "content": "Dow Jones futures will open Sunday evening, along with S&amp;P 500 futures and Nasdaq futures, after a big week for the Nasdaq and leading stocks.\r\nXApple (AAPL), Amazon.com (AMZN), Novo Nordisk (NVO… [+8785 chars]"
    },
    {
        "title": "Tech YES? Or Tech NO? What To Do In Wake Of Earnings",
        "date": "2024-04-26T20:15:14Z",
        "description": "Tech…yes? Or tech…no? This week gave investors in the technology sector a lot to think about thanks to key earnings reports from Big Tech",
        "content": "Techyes? Or techno? This week gave investors in the technology sector a lot to think about thanks to key earnings reports from Big Tech names like Meta Platforms, Microsoft, and Alphabet. Now, see wh… [+9119 chars]"
    },
    {
        "title": "Alphabet Reclaims Spot in $2 Trillion Market Cap Club",
        "date": "2024-04-26T16:55:10Z",
        "description": "Alphabet shares soared on Friday morning, launching the company into the tiny group of companies worth more than $2 trillion.",
        "content": "<ul><li>Google-parent Alphabet regained its status as a company with more than $2 trillion market capitalization as shares soared more than 10% Friday.</li><li>Alphabet became only the third U.S. com… [+1242 chars]"
    },
    {
        "title": "Sellers Lurk In Amazon Stock, Super Micro Computer Ahead Of Earnings",
        "date": "2024-04-26T15:32:04Z",
        "description": "A sell-off for Meta Platforms (META) cast a pall on first-quarter earnings season. Now attention turns to upcoming results for Amazon.com (AMZN) stock, as well as Super Micro Computer (SMCI) and Apple (AAPL). Amazon stock has come under selling pressure even …",
        "content": "A sell-off for Meta Platforms (META) cast a pall on first-quarter earnings season. Now attention turns to upcoming results for Amazon.com (AMZN) stock, as well as Super Micro Computer (SMCI) and Appl… [+294 chars]"
    },
    {
        "title": "Apple Strengthens Supply Chain in China While Growing Presence in Southeast Asia and India",
        "date": "2024-04-26T15:26:35Z",
        "description": "Apple Inc (NASDAQ:AAPL) is deepening its involvement with China while expanding its production in Southeast Asia and India, illustrating the iPhone maker’s...",
        "content": "Apple Strengthens Supply Chain in China While Growing Presence in Southeast Asia and India\r\nApple Inc (NASDAQ:AAPL) is deepening its involvement with China while expanding its production in Southeast… [+4073 chars]"
    },
    {
        "title": "Podcast links: fake podcast invites",
        "date": "2024-04-26T15:20:06Z",
        "description": "The biz Beware the fake podcast invite. (bigtechnology.com) The Apple ($AAPL)-Spotify ($SPOT) battle is just exhausting. (spyglass.org) Economy Barry Ritholtz talks with Bill McBride about which economic data really matters. (ritholtz.com) James Pethokoukis t…",
        "content": "The bizBeware the fake podcast invite. (bigtechnology.com)The Apple ($AAPL)-Spotify ($SPOT) battle is just exhausting. (spyglass.org)EconomyBarry Ritholtz talks with Bill McBride about which economic… [+322 chars]"
    },
    {
        "title": "Sellers Lurk In Amazon Stock, Super Micro Computer Ahead Of Earnings",
        "date": "2024-04-26T14:49:52Z",
        "description": "It's been a tame pullback so far for Amazon stock ahead of earnings, but the same can't be said for Super Micro Computer.",
        "content": "A sell-off for Meta Platforms (META) cast a pall on first-quarter earnings season. Now attention turns to upcoming results for Amazon.com (AMZN) stock, as well as Super Micro Computer (SMCI) and Appl… [+6479 chars]"
    },
    {
        "title": "Meta Platforms Bought Some Time With Long-Term AI Potential",
        "date": "2024-04-26T14:10:05Z",
        "description": "On Wednesday, Meta Platforms Inc META topped Wall Street estimates with its first quarter results. But, stock plunged 16% due to a light revenue guidance that overshadowed the fact its revenue grew at a fastest quarterly rate since 2021 and net income more th…",
        "content": "On Wednesday, Meta Platforms Inc META topped Wall Street estimates with its first quarter results. But, stock plunged 16% due to a light revenue guidance that overshadowed the fact its revenue grew a… [+296 chars]"
    },
    {
        "title": "Apple (NASDAQ:AAPL) Trading 0.5% Higher",
        "date": "2024-04-26T12:42:42Z",
        "description": "Apple Inc. (NASDAQ:AAPL – Get Free Report)’s stock price traded up 0.5% during mid-day trading on Wednesday . The stock traded as high as $168.30 and last traded at $167.79. 12,136,799 shares changed hands during trading, a decline of 80% from the average ses…",
        "content": "Apple Inc. (NASDAQ:AAPL – Get Free Report)’s stock price traded up 0.5% during mid-day trading on Wednesday . The stock traded as high as $168.30 and last traded at $167.79. 12,136,799 shares changed… [+6247 chars]"
    },
    {
        "title": "Jim Cramer Says 'There Are Hundreds Of Articles' About Apple Losing Top Spot In China: 'Google And Microsoft Can Barely Buy An Inch Of Ink After Some…",
        "date": "2024-04-26T11:50:05Z",
        "description": "“Mad Money” host Jim Cramer pointed out the disproportionate coverage of Apple Inc. AAPL “losing leadership” compared to Alphabet Inc.’s GOOG GOOGL Google and Microsoft Corp. MSFT post their “spectacular quarters.” What Happened: On Friday, Cramer took to X, …",
        "content": "Mad Money host Jim Cramer pointed out the disproportionate coverage of Apple Inc. AAPL losing leadership compared to Alphabet Inc.s GOOG GOOGL Google and Microsoft Corp. MSFT post their spectacular q… [+293 chars]"
    },
    {
        "title": "Alphabet Joins $2 Trillion Club",
        "date": "2024-04-26T11:30:09Z",
        "description": "Alphabet Inc. (NASDAQ: GOOGL), helped by strong earnings, will pass the $2 trillion market cap at the opening of trading. The only companies ahead of it are Microsoft Corp. (NASDAQ: MSFT) ($2.97 trillion), Apple Inc. (NASDAQ: AAPL) ($2.62 trillion), and Nvidi…",
        "content": "Alphabet Inc. (NASDAQ: GOOGL), helped by strong earnings, will pass the $2 trillion market cap at the opening of trading. The only companies ahead of it are Microsoft Corp. (NASDAQ: MSFT) ($2.97 tril… [+289 chars]"
    },
    {
        "title": "Will A Macau Recovery Drive MGM Stock Higher Following Q1 Results?",
        "date": "2024-04-26T11:00:00Z",
        "description": "MGM Resorts is expected to publish its Q1 2024 results on May 1, reporting on a quarter that is likely to see the company benefit from a strong recovery in Macau and p...",
        "content": "The lobby and giant aquarium in new MGM casino and hotel, Macau, China. (Photo by: Bob ... [+] Henry/UCG/Universal Images Group via Getty Images)\r\nUCG/Universal Images Group via Getty Images\r\nMGM Res… [+3405 chars]"
    },
    {
        "title": "Apple Inc. (NASDAQ:AAPL) Stock Holdings Increased by Alera Investment Advisors LLC",
        "date": "2024-04-26T10:28:41Z",
        "description": "Alera Investment Advisors LLC raised its holdings in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.6% during the 4th quarter, according to its most recent 13F filing with the Securities and Exchange Commission (SEC). The institutional investor owned 5…",
        "content": "Alera Investment Advisors LLC raised its holdings in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.6% during the 4th quarter, according to its most recent 13F filing with the Securities and E… [+6688 chars]"
    },
    {
        "title": "Apple Inc. (NASDAQ:AAPL) is Semus Wealth Partners LLC’s Largest Position",
        "date": "2024-04-26T10:28:41Z",
        "description": "Semus Wealth Partners LLC lowered its stake in Apple Inc. (NASDAQ:AAPL – Free Report) by 0.4% in the 4th quarter, according to the company in its most recent Form 13F filing with the Securities and Exchange Commission. The institutional investor owned 135,878…",
        "content": "Semus Wealth Partners LLC lowered its stake in Apple Inc. (NASDAQ:AAPL – Free Report) by 0.4% in the 4th quarter, according to the company in its most recent Form 13F filing with the Securities and E… [+6542 chars]"
    },
    {
        "title": "Avid Wealth Partners LLC Acquires New Position in Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-26T10:28:41Z",
        "description": "Avid Wealth Partners LLC acquired a new stake in Apple Inc. (NASDAQ:AAPL – Free Report) during the fourth quarter, according to its most recent 13F filing with the SEC. The fund acquired 3,891 shares of the iPhone maker’s stock, valued at approximately $749,0…",
        "content": "Avid Wealth Partners LLC acquired a new stake in Apple Inc. (NASDAQ:AAPL – Free Report) during the fourth quarter, according to its most recent 13F filing with the SEC. The fund acquired 3,891 shares… [+6270 chars]"
    },
    {
        "title": "Milestone Asset Management LLC Buys 387 Shares of Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-26T09:28:41Z",
        "description": "Milestone Asset Management LLC boosted its stake in Apple Inc. (NASDAQ:AAPL – Free Report) by 5.5% in the fourth quarter, according to its most recent disclosure with the Securities and Exchange Commission. The fund owned 7,460 shares of the iPhone maker’s st…",
        "content": "Milestone Asset Management LLC boosted its stake in Apple Inc. (NASDAQ:AAPL – Free Report) by 5.5% in the fourth quarter, according to its most recent disclosure with the Securities and Exchange Comm… [+6612 chars]"
    },
    {
        "title": "Regency Capital Management Inc. DE Buys 2,114 Shares of Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-26T09:28:41Z",
        "description": "Regency Capital Management Inc. DE lifted its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 111.9% in the 4th quarter, according to the company in its most recent 13F filing with the SEC. The institutional investor owned 4,004 shares of the iPh…",
        "content": "Regency Capital Management Inc. DE lifted its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 111.9% in the 4th quarter, according to the company in its most recent 13F filing with the S… [+6741 chars]"
    },
    {
        "title": "Up 17% YTD, What To Expect From EBay Q1 Results?",
        "date": "2024-04-26T09:00:06Z",
        "description": "We expect the stock to post mixed results with revenues beating the consensus but earnings missing the mark.",
        "content": "POLAND - 2024/02/23: In this photo illustration, an Ebay logo seen displayed on a smartphone. (Photo ... [+] Illustration by Mateusz Slodkowski/SOPA Images/LightRocket via Getty Images)\r\nSOPA Images/… [+3860 chars]"
    },
    {
        "title": "Indiana Trust & Investment Management CO Sells 645 Shares of Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-26T08:56:42Z",
        "description": "Indiana Trust & Investment Management CO decreased its holdings in Apple Inc. (NASDAQ:AAPL – Free Report) by 0.9% during the 4th quarter, according to the company in its most recent disclosure with the SEC. The fund owned 68,312 shares of the iPhone maker’s s…",
        "content": "Indiana Trust &amp; Investment Management CO decreased its holdings in Apple Inc. (NASDAQ:AAPL – Free Report) by 0.9% during the 4th quarter, according to the company in its most recent disclosure wi… [+7029 chars]"
    },
    {
        "title": "Apple’s (AAPL) Underweight Rating Reiterated at Barclays",
        "date": "2024-04-26T07:32:42Z",
        "description": "Barclays reaffirmed their underweight rating on shares of Apple (NASDAQ:AAPL – Free Report) in a research report sent to investors on Tuesday, Stock Target Advisor reports. They currently have a $158.00 price target on the iPhone maker’s stock. AAPL has been …",
        "content": "Barclays reaffirmed their underweight rating on shares of Apple (NASDAQ:AAPL – Free Report) in a research report sent to investors on Tuesday, Stock Target Advisor reports. They currently have a $158… [+6093 chars]"
    },
    {
        "title": "Apple looks to Southeast Asia, India as hedge against China difficulties",
        "date": "2024-04-26T04:49:07Z",
        "description": "Apple (AAPL) CEO Tim Cook toured Southeast Asia last week, visiting Vietnam, Indonesia, and Singapore, as part of a multiday trip geared toward reducing Apple’s reliance on China as its central manufacturing hub. And while Apple isn’t looking to abandon China…",
        "content": "Skip to comments.\r\nApple looks to Southeast Asia, India as hedge against China difficultiesYahoo Finance ^\r\n | 04/25/2024\r\n | Daniel Howley,·Technology Editor\r\nPosted on 04/25/2024 9:49:07 PM PDT by … [+3117 chars]"
    },
    {
        "title": "Parallels、Windows 11とLinux仮想マシンとの互換性を向上させた「Parallels Desktop for Mac App Store Edition v1.9.3」をリリース。",
        "date": "2024-04-26T03:13:00Z",
        "description": "ParallelsがWindows 11とLinux仮想マシンとの互換性を向上させた「Parallels Desktop for Mac App Store Edition v1.9.3」をリリースしています。詳細は以 […]\nThe post Parallels、Windows 11とLinux仮想マシンとの互換性を向上させた「Parallels Desktop for Mac App Store Edition v1.9.3」をリリース。 first appeared on AAPL Ch..",
        "content": "ParallelsWindows 11LinuxParallels Desktop for Mac App Store Edition v1.9.3\r\nAlludo(Corel)Parallels International GmbH.20240424Intel/Apple Silicon MacWindowsLinux, UnixParallels Desktop for v1.9.3Mac … [+676 chars]"
    },
    {
        "title": "Anker Japan、Qi2対応のiPhone用マグネット接続式ワイヤレス充電パッドと、Apple Watch、AirPods用充電器を備えた3-in-1ワイヤレス充電ステーション「Anker MagGo Wireless Charging Station (3-in-1 Pad/Stand)」を発売。",
        "date": "2024-04-26T02:46:15Z",
        "description": "Anker JapanがQi2に対応し最大15WでiPhoneをワイヤレス充電できるマグネット接続式パッドに加え、Apple WatchとAirPodsの充電も可能な3-in-1ワイヤレス充電ステーション「Anker […]\nThe post Anker Japan、Qi2対応のiPhone用マグネット接続式ワイヤレス充電パッドと、Apple Watch、AirPods用充電器を備えた3-in-1ワイヤレス充電ステーション「Anker MagGo Wireless Charging Station (3-in-1…",
        "content": "Anker JapanQi215WiPhoneApple WatchAirPods3-in-1Anker MagGo Wireless Charging Station (3-in-1 Pad/Stand)\r\nAnker Japan20240426iPhone 1515WQi2Apple WatchAirPods3-in-1Anker MagGo Wireless Charging Statio… [+645 chars]"
    },
    {
        "title": "米Satechi、iPhoneを最大15Wで充電できるQi2ワイヤレス充電器に加えApple WatchとAirPodsの充電にも対応した折りたたみ式の充電スタンド「Satechi 3-in-1 Foldable Qi2 Wireless Charging Stand」を発売。",
        "date": "2024-04-25T20:19:45Z",
        "description": "米SatechiがiPhoneを最大15Wで充電できるQi2ワイヤレス充電器に加えApple WatchとAirPodsの充電にも対応した折りたたみ式の充電スタンド「Satechi 3-in-1 Foldable Qi […]\nThe post 米Satechi、iPhoneを最大15Wで充電できるQi2ワイヤレス充電器に加えApple WatchとAirPodsの充電にも対応した折りたたみ式の充電スタンド「Satechi 3-in-1 Foldable Qi2 Wireless Charging Stand」を…",
        "content": "SatechiiPhone15WQi2Apple WatchAirPodsSatechi 3-in-1 Foldable Qi2 Wireless Charging Stand\r\nSatechi20240425Qi2iPhone15WApple WatchAirPods3-in-1Satechi 3-in-1 Foldable Qi2 Wireless Charging Stand (ST-Q3… [+588 chars]"
    },
    {
        "title": "Google Earnings Handily Beat Wall Street Targets. Google Stock Dividend Approved.",
        "date": "2024-04-25T20:17:08Z",
        "description": "Google stock soared after parent Alphabet reported first-quarter earnings and revenue that handily beat consensus estimates.",
        "content": "Alphabet (GOOGL) on Thursday reported first-quarter earnings and revenue that handily beat consensus estimates. The company announced its first ever dividend, sending Google stock soaring.\r\nXReported… [+1731 chars]"
    },
    {
        "title": "Market Clubhouse Morning Memo - April 25th, 2024 (Trade Strategy For SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, And TSLA)",
        "date": "2024-04-25T14:36:05Z",
        "description": "Good Morning Traders! In today's Market Clubhouse Morning Memo, we will discuss SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, and TSLA. Our proprietary formula, exclusive to Market Clubhouse, dictates these price levels. This dynamic equation takes into account pr…",
        "content": "Good Morning Traders! In today's Market Clubhouse Morning Memo, we will discuss SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, and TSLA.Our proprietary formula, exclusive to Market Clubhouse, dictates thes… [+267 chars]"
    },
    {
        "title": "Dow Jones Futures Dive 400 Points On Weak GDP Data; Meta Plunges On Earnings",
        "date": "2024-04-25T12:48:27Z",
        "description": "Other key earnings movers include Caterpillar, Chipotle, IBM and ServiceNow.",
        "content": "Dow Jones futures dived along with the other major stock indexes Thursday, as Wall Street reacted to weak first-quarter GDP data, while Magnificent Seven player Meta Platforms (META) plunged on first… [+7191 chars]"
    },
    {
        "title": "Apple (NASDAQ:AAPL) Trading 0.3% Higher",
        "date": "2024-04-25T11:48:43Z",
        "description": "Apple Inc. (NASDAQ:AAPL – Get Free Report)’s share price traded up 0.3% during trading on Tuesday . The company traded as high as $166.71 and last traded at $166.34. 13,442,888 shares traded hands during trading, a decline of 78% from the average session volu…",
        "content": "Apple Inc. (NASDAQ:AAPL – Get Free Report)’s share price traded up 0.3% during trading on Tuesday . The company traded as high as $166.71 and last traded at $166.34. 13,442,888 shares traded hands du… [+6605 chars]"
    },
    {
        "title": "The Top 7 Mutual Funds to Buy in April 2024",
        "date": "2024-04-25T10:58:07Z",
        "description": "Despite the recent excitement in the stock and cryptocurrency markets following the recent Bitcoin (BTC-USD) halving event, the idea of investing in the top mutual funds might not seem as attractive. However, unexciting investments can still be effective. In …",
        "content": "Despite the recent excitement in the stock and cryptocurrency markets following the recent Bitcoin (BTC-USD) halving event, the idea of investing in the top mutual funds might not seem as attractive.… [+298 chars]"
    },
    {
        "title": "How Will AMD’s AI Business Fare In Q1?",
        "date": "2024-04-25T10:00:00Z",
        "description": "The company has guided gross margins of 52% for the year, marking a 200 basis point increase compared to last year.",
        "content": "POLAND - 2024/04/18: In this photo illustration, a AMD logo is displayed on a smartphone with ... [+] electronic board in the background. (Photo Illustration by Omar Marques/SOPA Images/LightRocket v… [+4398 chars]"
    },
    {
        "title": "Bridges Investment Management Inc. Sells 4,827 Shares of Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-25T08:12:45Z",
        "description": "Bridges Investment Management Inc. lessened its stake in Apple Inc. (NASDAQ:AAPL – Free Report) by 0.5% during the fourth quarter, according to the company in its most recent 13F filing with the Securities & Exchange Commission. The fund owned 958,322 shares …",
        "content": "Bridges Investment Management Inc. lessened its stake in Apple Inc. (NASDAQ:AAPL – Free Report) by 0.5% during the fourth quarter, according to the company in its most recent 13F filing with the Secu… [+6761 chars]"
    },
    {
        "title": "Tapbots、2011年から開発を続けてきたiPhone＆iPad用Twitterクライアント「Tweetbot for Twitter」をApp Storeから削除。",
        "date": "2024-04-25T00:07:24Z",
        "description": "Tapbotsが2011年から開発を続けてきたiPhone&iPad用Twitterクライアント「Tweetbot for Twitter」をApp Storeから削除したと発表しています。詳細は以下から。 […]\nThe post Tapbots、2011年から開発を続けてきたiPhone＆iPad用Twitterクライアント「Tweetbot for Twitter」をApp Storeから削除。 first appeared on AAPL Ch..",
        "content": "Tapbots2011iPhone&amp;iPadTwitterTweetbot for TwitterApp Store\r\nTapbosPaul Haddad20240424202301Twitter(X)iPhone&amp;iPadTwitterTweetbot for TwitterAppleApp Store\r\nTapbots202301Twitter for MacTwitterA… [+85 chars]"
    },
    {
        "title": "Qualcomm's Latest Laptop Chips for AI Could Help It Compete With Intel and AMD",
        "date": "2024-04-24T23:43:23Z",
        "description": "Qualcomm announced the upcoming release of its Snapdragon X Plus laptop processor with artificial intelligence capabilities, in a move that could help it better compete with rivals.",
        "content": "<ul><li>Qualcomm on Wednesday announced its Snapdragon X Plus laptop processor with artificial intelligence capabilities, in a move that could help it better compete with rivals.</li><li>The chip is … [+1549 chars]"
    },
    {
        "title": "Analysts reset Microsoft stock price targets ahead of highly anticipated earnings",
        "date": "2024-04-24T23:42:07Z",
        "description": "Microsoft shares closed modestly higher Wednesday ahead of the software and cloud computing giant's third quarter earnings report, slated for after the closing bell on April 25. Microsoft (MSFT) , which overtook Apple (AAPL) as the world's most-valuable compa…",
        "content": "Microsoft shares closed modestly higher Wednesday ahead of the software and cloud computing giant's third quarter earnings report, slated for after the closing bell on April 25. Microsoft (MSFT) , wh… [+285 chars]"
    },
    {
        "title": "12.9-Inch iPad Air No Longer Expected to Feature Mini-LED Display - MacRumors",
        "date": "2024-04-24T18:15:21Z",
        "description": "12.9-Inch iPad Air No Longer Expected to Feature Mini-LED DisplayMacRumors OLED iPads and more: What Apple plans for its May ‘Let Loose’ eventThe Verge iPad Pro and Air 2024: What to Expect, Release Date, Price, FeaturesBusiness Insider Apple (AAPL) Growth Op…",
        "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
    },
    {
        "title": "AI Chip Leader Arm Stock Plunges 31%, Is It A Buy Right Now?",
        "date": "2024-04-24T17:57:31Z",
        "description": "Arm Holdings plunged last week, diving below key support.",
        "content": "Artificial intelligence chip stock Arm Holdings (ARM) surged as much as 152% past a recent buy point. Following that advance, is Arm stock a buy in today's stock market?\r\nXArm stock plunged 31% last … [+3962 chars]"
    },
    {
        "title": "The Apple Vision Pro Reinforces The Continuing Problem With VR Adoption - Forbes",
        "date": "2024-04-24T17:53:45Z",
        "description": "The Apple Vision Pro Reinforces The Continuing Problem With VR AdoptionForbes Apple reportedly cuts Vision Pro production due to low demandThe Verge Apple reportedly slashes Vision Pro headset production and cancels updated headset as sales tank in the USPC G…",
        "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
    },
    {
        "title": "Apple Slashes Vision Pro Shipment Projections By 50% As Demand For $3,500 Headset Craters",
        "date": "2024-04-24T16:32:05Z",
        "description": "Apple Slashes Vision Pro Shipment Projections By 50% As Demand For $3,500 Headset Craters In what will come as a surprise to exactly nobody, the revolutionary if ridiculously overpriced Vision Pro virtual reality headset, which retails for $3,500, is not sell…",
        "content": "Apple Slashes Vision Pro Shipment Projections By 50% As Demand For $3,500 Headset Craters\r\nIn what will come as a surprise to exactly nobody, the revolutionary if ridiculously overpriced Vision Pro v… [+272 chars]"
    },
    {
        "title": "Dow Jones Futures Fall As Boeing, Tesla Jump On Earnings; Meta Earnings Next",
        "date": "2024-04-24T12:56:16Z",
        "description": "Stock Market Today: Dow Jones futures fell Wednesday as Boeing and Tesla jumped on earnings. Meta earnings are due late.",
        "content": "Dow Jones futures and the other major stock indexes looked to continue their recent string of gains Wednesday morning, as Boeing (BA) and Tesla (TSLA) jumped on first-quarter earnings results. Next u… [+6579 chars]"
    },
    {
        "title": "$433 Billion Gone! One Stock Loses More Value Than Tesla",
        "date": "2024-04-24T12:40:04Z",
        "description": "Tesla's loss of $328.3 billion this year in stock value certainly hurts. But it's amazingly only the second-largest market value loss in the S&P 500. The dubious distinction of shredding the most value this year goes to Apple (AAPL). The Johnny-come-lately to…",
        "content": "Tesla's loss of $328.3 billion this year in stock value certainly hurts. But it's amazingly only the second-largest market value loss in the S&amp;P 500.The dubious distinction of shredding the most … [+300 chars]"
    },
    {
        "title": "Banning TikTok would hit China’s tech ambitions and deepen the global digital divide | CNN Business",
        "date": "2024-04-24T12:09:35Z",
        "description": "TikTok is facing an existential crisis in America. If its Chinese owner fails to sell the app in the next year or so, it could be banned in its biggest market.",
        "content": "Editors Note: Sign up for CNNs Meanwhile in China newsletter which explores what you need to know about the countrys rise and how it impacts the world.\r\nTikTok is facing an existential crisis in Amer… [+6373 chars]"
    },
    {
        "title": "‘Irrational excitement’ over AI will wipe out tech stocks, says contrarian investor who has nailed prior selloffs",
        "date": "2024-04-24T10:43:00Z",
        "description": "Steven Jon Kaplan, author of the True Contrarian blog and newsletter, says a popular tech ETF is headed for hard times thanks to “irrational” AI excitement.",
        "content": "Tech stocks are ready to bounce after yet another Tesla twist, but our call of the day says the sector is doomed to repeat history. Steven Jon Kaplan, True Contrarian blog and newsletters chief execu… [+6633 chars]"
    },
    {
        "title": "Apple Inc. (NASDAQ:AAPL) is RPg Family Wealth Advisory LLC’s 2nd Largest Position",
        "date": "2024-04-24T10:42:41Z",
        "description": "RPg Family Wealth Advisory LLC boosted its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 5.8% during the 4th quarter, according to its most recent 13F filing with the Securities & Exchange Commission. The firm owned 46,808 shares of the iPho…",
        "content": "RPg Family Wealth Advisory LLC boosted its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 5.8% during the 4th quarter, according to its most recent 13F filing with the Securities &am… [+6818 chars]"
    },
    {
        "title": "Independence Bank of Kentucky Raises Stake in Apple Inc. (NASDAQ:AAPL)",
        "date": "2024-04-24T10:42:41Z",
        "description": "Independence Bank of Kentucky lifted its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.3% in the 4th quarter, according to its most recent Form 13F filing with the Securities & Exchange Commission. The institutional investor owned 64,728 s…",
        "content": "Independence Bank of Kentucky lifted its position in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.3% in the 4th quarter, according to its most recent Form 13F filing with the Securities &amp… [+6516 chars]"
    },
    {
        "title": "Apple Inc. (NASDAQ:AAPL) Stake Decreased by Farmers & Merchants Investments Inc.",
        "date": "2024-04-24T10:42:41Z",
        "description": "Farmers & Merchants Investments Inc. lessened its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.2% in the fourth quarter, according to its most recent Form 13F filing with the SEC. The fund owned 462,765 shares of the iPhone maker’s stock aft…",
        "content": "Farmers &amp; Merchants Investments Inc. lessened its stake in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.2% in the fourth quarter, according to its most recent Form 13F filing with the SE… [+6547 chars]"
    },
    {
        "title": "China In Focus As Apple Reports Q2 Results",
        "date": "2024-04-24T09:00:55Z",
        "description": "We expect earnings to stand at $1.52 per share, marginally ahead of consensus estimates.",
        "content": "Apple Watch SE is seen in a store in Krakow, Poland on April 20, 2024. (Photo by Jakub ... [+] Porzycki/NurPhoto via Getty Images)\r\nNurPhoto via Getty Images\r\nAppleApple\r\n is expected to publish its … [+4303 chars]"
    },
    {
        "title": "Apple Inc. (NASDAQ:AAPL) Holdings Lessened by Iowa State Bank",
        "date": "2024-04-24T08:24:41Z",
        "description": "Iowa State Bank reduced its holdings in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.1% in the fourth quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The fund owned 83,798 shares of the iPh…",
        "content": "Iowa State Bank reduced its holdings in shares of Apple Inc. (NASDAQ:AAPL – Free Report) by 0.1% in the fourth quarter, according to the company in its most recent disclosure with the Securities and … [+6827 chars]"
    },
    {
        "title": "Apple、開発者向けに「macOS 14.5 Sonoma」や「iOS/iPadOS 17.5」、「visionOS 1.2」のBeta 3を公開。",
        "date": "2024-04-23T22:23:30Z",
        "description": "Appleが開発者向けに「macOS 14.5 Sonoma」や「iOS/iPadOS 17.5」、「visionOS 1.2」のBeta 3を公開しています。詳細は以下から。 　Appleは現地時間2024年04月2 […]\nThe post Apple、開発者向けに「macOS 14.5 Sonoma」や「iOS/iPadOS 17.5」、「visionOS 1.2」のBeta 3を公開。 first appeared on AAPL Ch..",
        "content": "ApplemacOS 14.5 SonomaiOS/iPadOS 17.5visionOS 1.2Beta 3\r\nApple2024042309macOS Sonoma/iOS 17macOS 14.5 SonomaiOS/iPadOS 17.5tvOS 17.5watchOS 10.5visionOS 1.2Beta 3\r\n<ul><li>iOS 17.5 beta 3 (21F5063f)<… [+570 chars]"
    },
    {
        "title": "Quant Ratings Updated on 113 Stocks",
        "date": "2024-04-23T20:42:09Z",
        "description": "Earnings season is heating up this week, with four of the seven Magnificent Seven stocks – Alphabet, Inc. (GOOGL), Meta Platforms, Inc. (META), Microsoft Corporation (MSFT) and Tesla, Inc. (TSLA) – slated to announce their latest quarterly results. (Amazon.co…",
        "content": "Earnings season is heating up this week, with four of the seven Magnificent Seven stocks Alphabet, Inc. (GOOGL), Meta Platforms, Inc. (META), Microsoft Corporation (MSFT) and Tesla, Inc. (TSLA) slate… [+312 chars]"
    },
    {
        "title": "Kuo: Apple cuts Vision Pro shipments, now 'reviewing and adjusting' headset strategy - 9to5Mac",
        "date": "2024-04-23T18:53:48Z",
        "description": "Kuo: Apple cuts Vision Pro shipments, now 'reviewing and adjusting' headset strategy9to5Mac Everyone Already Forgot About the Apple Vision ProGizmodo AR Smart glasses are everything the Vision Pro should have beenLaptop Mag Apple (AAPL) Growth Opportunities: …",
        "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
    },
    {
        "title": "Apple Expected To Unveil New iPads at Event on May 7",
        "date": "2024-04-23T18:07:51Z",
        "description": "Apple is expected to unveil new iPads at a May 7 event, hoping to reverse recent struggles in its hardware sales.",
        "content": "<ul><li>Apple on Tuesday announced a May 7 event, where it is expected to reveal a new iPad range.</li><li>The company's first launch event for 2024 is expected to include the rumored OLED iPad Pro.<… [+1868 chars]"
    },
    {
        "title": "Dear AAPL Stock Fans, Mark Your Calendars for May 7",
        "date": "2024-04-23T16:28:05Z",
        "description": "AAPL stock could see a major catalyst come May 7 Apple (NASDAQ:AAPL) stock fans will want to check in on the tech giant when May 7 rolls around for a major catalyst for its shares. That’s when Apple is holding a major event to showcase some of its newest tech…",
        "content": "AAPL stock could see a major catalyst come May 7Apple (NASDAQ:AAPL) stock fans will want to check in on the tech giant when May 7 rolls around for a major catalyst for its shares.Thats when Apple is … [+280 chars]"
    },
    {
        "title": "Apple's Q1 smartphone shipments in China tumble 19%, data shows - Reuters",
        "date": "2024-04-23T16:13:07Z",
        "description": "Apple's Q1 smartphone shipments in China tumble 19%, data showsReuters Apple's (AAPL) IPhone Sales in China Post Worst Decline Since 2020Bloomberg Apple iPhone sales drop 19% in China as demand for Huawei smartphones soars, research saysCNBC Apple iPhone sale…",
        "content": "The rule on staying alive as a program manager is to give 'em a number or \r\ngive 'em a date, but never give 'em both at once."
    },
    {
        "title": "Apple announces event for May 7 amid reports of new iPad model launches",
        "date": "2024-04-23T15:46:04Z",
        "description": "Apple AAPL-Q will hold an event on May 7, the company said on Tuesday, amid reports that it would roll out the long-anticipated revamped versions of iPad Pro and iPad Air next month. The Cupertino, California-based company did not disclose more details about …",
        "content": "Apple AAPL-Q will hold an event on May 7, the company said on Tuesday, amid reports that it would roll out the long-anticipated revamped versions of iPad Pro and iPad Air next month.The Cupertino, Ca… [+284 chars]"
    },
    {
        "title": "Apple's (AAPL) IPhone Sales in China Post Worst Decline Since 2020 - Bloomberg",
        "date": "2024-04-23T14:54:03Z",
        "description": "Apple's (AAPL) IPhone Sales in China Post Worst Decline Since 2020Bloomberg Apple iPhone sales drop 19% in China as demand for Huawei smartphones soars, research saysCNBC Apple's Q1 smartphone shipments in China tumble 19%, data showsReuters Apple: Our Point …",
        "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
    },
    {
        "title": "Apple's June guidance will miss Street estimates",
        "date": "2024-04-23T14:42:03Z",
        "description": "Barclays analysts said they expect Apple (NASDAQ: ) to report in-line results for the March quarter, but believe the tech giant’s June quarter guidance will miss expectations “due to softening hardware demand, which would continue a multi-quarter trend for AA…",
        "content": "Barclays analysts said they expect Apple (NASDAQ: ) to report in-line results for the March quarter, but believe the tech giants June quarter guidance will miss expectations due to softening hardware… [+241 chars]"
    },
    {
        "title": "Here’s What To Expect From Corning’s Q1",
        "date": "2024-04-23T14:30:13Z",
        "description": "We expect the company’s revenues to come in at $3.1 billion and adjusted earnings of $0.35 per share, aligning with the consensus estimates.",
        "content": "UKRAINE - 2021/10/09: In this photo illustration Corning Incorporated logo seen displayed on a ... [+] smartphone and in the background. (Photo Illustration by Igor Golovniov/SOPA Images/LightRocket … [+3675 chars]"
    },
    {
        "title": "Apple's China iPhone Sales Plunge 19% in First Quarter as Huawei Catches Up",
        "date": "2024-04-23T13:24:33Z",
        "description": "Apple’s sales of iPhones in China, its biggest overseas market, fell by 19% year-over-year during the March quarter.",
        "content": "<ul><li>Apples sales of iPhones in China, its biggest overseas market, fell by 19% year-over-year during the March quarter.</li><li>The iPhone maker's market share fell to third from first in China, … [+1843 chars]"
    },
    {
        "title": "Rising 25% Year To Date, Will Q1 Results Drive Chipotle Stock Higher?",
        "date": "2024-04-23T13:00:45Z",
        "description": "We expect CMG’s stock to trade lower with revenues and earnings missing the expectations marginally in its first-quarter results.",
        "content": "NEW YORK, NEW YORK - FEBRUARY 06: A Chipolte restaurant stands in Manhattan on February 06, 2024 in ... [+] New York City. Chipotle Mexican Grill (CMG) reports Q4 and full-year results late Tuesday. … [+6092 chars]"
    },
    {
        "title": "Apple’s first-quarter smartphone shipments in China tumble 19%, data shows",
        "date": "2024-04-23T12:02:05Z",
        "description": "Apple’s AAPL-Q smartphone shipments in China tumbled 19% in the first quarter of the year, the worst performance since 2020, as the iPhone maker took a hit from Huawei’s new product launches in the premium segment, market data showed. Apple’s share in the wor…",
        "content": "Apples AAPL-Q smartphone shipments in China tumbled 19% in the first quarter of the year, the worst performance since 2020, as the iPhone maker took a hit from Huaweis new product launches in the pre… [+296 chars]"
    },
    {
        "title": "China iPhone Sales Collapse Nearly 20%",
        "date": "2024-04-23T11:52:10Z",
        "description": "In yet another sign that Apple Inc. (NASDAQ: AAPL) iPhone sales and earnings are in deep trouble, Bloomberg posted an exclusive article stating that iPhone sales in China dropped 19% in the first quarter, the worst quarter since 2020. “The iPhone weakness is …",
        "content": "In yet another sign that Apple Inc. (NASDAQ: AAPL) iPhone sales and earnings are in deep trouble, Bloomberg posted an exclusive article stating that iPhone sales in China dropped 19% in the first qua… [+266 chars]"
    }
]